<?php

/* Задание №1:
$i = 0;
    while ($i++ <= 100) if ($i % 3 == 0)
    echo "$i <br>";
*/


/* Задание №2:
$i = 0;
    do {
          $string = "нечетное число";
        if ($i == 0) {
          $string = "ноль";
        }elseif ($i % 2 == 0) {
          $string = "четное число";
        }
        echo "$i = это " .$string ."<br>";
        }
    while (++$i <= 10);
*/

/* Задание №3:
$array = [
    "Московская область" => ["Москва", "Зеленоград", "Клин"],
    "Ленинградская область" => ["Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"],
    "Архангельская область" => ["Архангельск", "Северодвинск", "Котлас", "Новодвинск"],
    "Липецкая область" => ["Липецк", "Елец", "Грязи", "Лебедянь", "Задонск", "Кривополянье"]
];
foreach ($array as $state => $towns) {
    echo "<b>$state:</b><br>";
    foreach ($towns as $key => $value) {
        $comma = ($key < count($towns) - 1) ? ", " : "";
        echo "$value" . $comma;
    }
    echo "<br>";
}
*/

/*Задание №7:
for ($i = 0; $i < 10; print $i++ . "<br>") {
    }
*/
?>